// С#. Уровень 1
// Домашнее задание к уроку 2
// Бут Сергей
//
// === Задание 03 ===
// * Описать класс дробей - рациональных чисел, являющихся отношением
// двух целых чисел.Предусмотреть методы сложения, вычитания, умножения
// и деления дробей. Написать программу, демонстрирующую все разработанные
// элементы класса.Достаточно решить 2 задачи.Все программы сделать в одном решении.
// ** Добавить проверку, чтобы знаменатель не равнялся 0. Выбрасывать исключение
// ArgumentException("Знаменатель не может быть равен 0");
// Добавить упрощение дробей.


using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Task03
{
    class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
