// С#. Уровень 1
// Домашнее задание к уроку 4
// Бут Сергей
//
// === Задание 01 ===
//
// Дан целочисленный  массив из 20 элементов.Элементы массива  могут принимать 
// целые значения  от –10 000 до 10 000 включительно.Заполнить случайными числами.
// Написать программу, позволяющую найти и вывести количество пар элементов массива,
// в которых только одно число делится на 3. В данной задаче под парой подразумевается
// два подряд идущих элемента массива.Например, для массива из пяти элементов:
// 6; 2; 9; –3; 6 ответ — 2. 


using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Task01
{
    class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
