// С#. Уровень 1
// Домашнее задание к уроку 2
// Бут Сергей
//
// === Задание 02 ===
// а) С клавиатуры вводятся числа, пока не будет введен 0
// (каждое число в новой строке). Требуется подсчитать сумму
// всех нечетных положительных чисел.Сами числа и сумму вывести
// на экран, используя tryParse;
// б) Добавить обработку исключительных ситуаций на то, что могут
// быть введены некорректные данные.При возникновении ошибки
// вывести сообщение.Напишите соответствующую функцию;


using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Task02
{
    class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
