// С#. Уровень 1
// Домашнее задание к уроку 2
// Бут Сергей
//
// === Задание 04 ===
// Реализовать метод проверки логина и пароля.На вход подается логин и пароль.
// На выходе истина, если прошел авторизацию, и ложь, если не прошел (Логин: root,
// Password: GeekBrains). Используя метод проверки логина и пароля, написать программу:
// пользователь вводит логин и пароль, программа пропускает его дальше или не пропускает.
// С помощью цикла do while ограничить ввод пароля тремя попытками.


using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Task04
{
    class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
